public_html/git-basic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Git 基本操作</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Git 基本操作"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-27T22:18+0800"/>
<meta name="author" content="tuhaihe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="css/org.css" rel="stylesheet" type="text/css">
<link href="css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="css/bootstrap-responsive.min.css" rel="stylesheet">


</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Git 基本操作</h1>


<script src="js/bootstrap.js"></script>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">简介</a></li>
<li><a href="#sec-2">安装</a></li>
<li><a href="#sec-3">基本操作</a></li>
<li><a href="#sec-4">更多学习资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">简介</h2>
<div class="outline-text-2" id="text-1">

<p>  Linux 内核和 Git 是 Linus 迄今最为杰出的 2 个伟大作品。Git 这个分布式的版本控制系统，由开始开发到项目发布，仅用了 3 天时间。
</p>
<p>
  学会使用 Git，是每个人的必修技能。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">安装</h2>
<div class="outline-text-2" id="text-2">





<pre class="example">sudo apt-get install git # Debian 系列
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">基本操作</h2>
<div class="outline-text-2" id="text-3">


<p>
  1.设置用户信息
</p>
<p>  
   Git 配置文件为 <code>~/.gitconfig</code> 或系统全局设置 <code>/etc/gitconfig</code> 。
</p>



<pre class="example">$ git config –-global user.name “tuhaihe″ #该昵称显示在提交时使用
$ git config –-global user.email zhsan@gmail.com #该邮箱提交时使用
</pre>


<p>
   在上述设置完毕后，可运行下面命令查看自己的设置：
</p>



<pre class="example">$ git config user.name
$ git config user.email
</pre>


<p>
  2.创建仓库(以 Github 为例)
</p>
<ul>
<li>在 Github 创建账号后，点击 <a href="https://github.com/new">New Repository</a> ，填写与本仓库相关的信息，如仓库名称、描述、是否公开。设置完毕后，点击“Create repository”即可创建新仓库。如，建立 test。

</li>
<li>仓库创建完毕，我们开始创建 README 文件，这个是对仓库的详细介绍，或者写些你认为重要的描述。
</li>
</ul>





<pre class="example">$ mkdir ~/test #本地创建 test 文件夹
$ cd test/
$ git init #初始化 Git 仓库
$ touch README #创建README，但该文件尚未添加到版本库
</pre>


<p>
  3.提交文件到版本库
</p>



<pre class="example">$ git add README #将创建的 README 文件加入到版本库
$ git commit -m "commit README" #将文件提交到版本库
$ git log #查看提交日志
</pre>


<p>
  4.推送到 Github 远程仓库
</p>
<p>
  上述一系列操作，我们只是在本地建立了一个 Git 版本库，我们还需要将其推送到远程服务器(Github 仓库)。完成下述操作后，我们就可以在 Github 页面上看到我们提交的文件了。
</p>



<pre class="example">$ git remote add origin https://github.com/tuhaihe/test.git
$ git push origin master #推送到Github test仓库主枝，一般默认为 master
</pre>


<p>
  5.更多操作
</p>
<ul>
<li>查看修改后的文件与版本库中的文件差异
</li>
</ul>




<pre class="example">$ git diff
</pre>


<ul>
<li>查看状态
</li>
</ul>




<pre class="example">$ git status
</pre>


<p>       
  6.需要注意的几个问题
</p>
<ul>
<li>使用 <code>rm ~/file.txt</code> 删除了本地仓库中的文件，但在远程仓库中仍旧存在。

<p>
     解释：使用 rm 只是删除了本地文件，并没有将 file.txt 从版本库中删除，可以使用 <code>git rm file.txt</code> 将该文件从版本库中删除。
</p>
</li>
<li>使用 <code>git clone</code> 克隆的仓库无法提交更改。

<p>   
     解释：git 支持 SSH 协议、HTTP 协议、Git 协议进行数据传输。SSH 协议支持读写操作，通过 HTTP 和 Git 协议克隆下来的仓库仅只读(如果要支持写，需要进行设置)，建议使用 SSH 协议进行克隆。
</p>
</li>
<li>Git 版本控制三部曲：“git add&ndash;&gt;git commit&ndash;&gt;git push”。
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">更多学习资料</h2>
<div class="outline-text-2" id="text-4">


<ul>
<li>《Git 权威指南》，蒋鑫；
</li>
<li><a href="http://git-scm.com/book/zh">《Pro Git》中文版</a>；
</li>
<li><a href="http://rogerdudler.github.io/git-guide/index.zh.html">Git - 简易指南</a>：一个教你入门的教程
</li>
<li><a href="http://marklodato.github.io/visual-git-guide/index-zh-cn.html">图解 Git</a>
</li>
<li><a href="http://gitref.org/index.html">Git Reference</a>
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="postamble">Update time: 2013-04-27T22:18+0800.</p> 
</div>
</body>
</html>
